spec/cassettes/isbm/consumer_publication/with_valid_arguments_open_session_returns_a_session_id.yml

--- 
http_interactions: 
  - request: 
      method: post
      uri: http://simpleisbm.apphb.com/ChannelManagementService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:CreateChannel><ChannelURI>Test</ChannelURI><ChannelType>Publication</ChannelType></ins0:CreateChannel></env:Body></env:Envelope>
      headers: 
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/CreateChannel\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "487"
        cookie: 
          - ASP.NET_SessionId=xnpbakwaaxj5de5gepzhws0r
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        server: 
          - nginx
        date: 
          - Wed, 08 Aug 2012 15:37:34 GMT
        content-type: 
          - text/xml; charset=utf-8
        content-length: 
          - "260"
        connection: 
          - keep-alive
        cache-control: 
          - private
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><CreateChannelResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Wed, 08 Aug 2012 15:37:55 GMT
  - request: 
      method: post
      uri: http://simpleisbm.apphb.com/ConsumerPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:OpenSubscriptionSession><ChannelURI>Test</ChannelURI><Topic>topic</Topic></ins0:OpenSubscriptionSession></env:Body></env:Envelope>
      headers: 
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/OpenSubscriptionSession\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "489"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        server: 
          - nginx
        date: 
          - Wed, 08 Aug 2012 15:37:34 GMT
        content-type: 
          - text/xml; charset=utf-8
        content-length: 
          - "362"
        connection: 
          - keep-alive
        cache-control: 
          - private
        set-cookie: 
          - ASP.NET_SessionId=wm1zsut2mol4n0zksb33uvgk; path=/; HttpOnly
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><OpenSubscriptionSessionResponse xmlns="http://www.openoandm.org/xml/ISBM/"><SessionID>979d4a04-9ac6-4954-8514-9922cb85ea46</SessionID></OpenSubscriptionSessionResponse></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Wed, 08 Aug 2012 15:37:55 GMT
  - request: 
      method: post
      uri: http://simpleisbm.apphb.com/ProviderPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:OpenPublicationSession><ChannelURI>Test</ChannelURI></ins0:OpenPublicationSession></env:Body></env:Envelope>
      headers: 
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/OpenPublicationSession\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "467"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        server: 
          - nginx
        date: 
          - Wed, 08 Aug 2012 15:37:34 GMT
        content-type: 
          - text/xml; charset=utf-8
        content-length: 
          - "360"
        connection: 
          - keep-alive
        cache-control: 
          - private
        set-cookie: 
          - ASP.NET_SessionId=s3vlu21lpxqd05ifkti2zam0; path=/; HttpOnly
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><OpenPublicationSessionResponse xmlns="http://www.openoandm.org/xml/ISBM/"><SessionID>bb6381ec-50d5-4bb7-b734-b1078bb1bbbd</SessionID></OpenPublicationSessionResponse></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Wed, 08 Aug 2012 15:37:56 GMT
  - request: 
      method: post
      uri: http://simpleisbm.apphb.com/ProviderPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:ClosePublicationSession><SessionID>bb6381ec-50d5-4bb7-b734-b1078bb1bbbd</SessionID></ins0:ClosePublicationSession></env:Body></env:Envelope>
      headers: 
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/ClosePublicationSession\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "499"
        cookie: 
          - ASP.NET_SessionId=s3vlu21lpxqd05ifkti2zam0
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        server: 
          - nginx
        date: 
          - Wed, 08 Aug 2012 15:37:35 GMT
        content-type: 
          - text/xml; charset=utf-8
        content-length: 
          - "270"
        connection: 
          - keep-alive
        cache-control: 
          - private
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><ClosePublicationSessionResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Wed, 08 Aug 2012 15:37:56 GMT
  - request: 
      method: post
      uri: http://simpleisbm.apphb.com/ChannelManagementService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:DeleteChannel><ChannelURI>Test</ChannelURI></ins0:DeleteChannel></env:Body></env:Envelope>
      headers: 
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/DeleteChannel\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "449"
        cookie: 
          - ASP.NET_SessionId=xnpbakwaaxj5de5gepzhws0r
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        server: 
          - nginx
        date: 
          - Wed, 08 Aug 2012 15:37:35 GMT
        content-type: 
          - text/xml; charset=utf-8
        content-length: 
          - "260"
        connection: 
          - keep-alive
        cache-control: 
          - private
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><DeleteChannelResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Wed, 08 Aug 2012 15:37:56 GMT
recorded_with: VCR 2.2.4
